day1/video-games-tournament-master/app/controllers/api/players_controller.rb

  def index
    players = Player.all
---
SELECT "players".* FROM "players"