day1/video-games-tournament-master/app/controllers/api/tournaments_controller.rb

SELECT "tournaments".* FROM "tournaments"
---
  def index
    tournaments = Tournament.all

INSERT INTO "tournaments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "tour5"], ["created_at", "2016-09-13 13:26:03.455703"], ["updated_at", "2016-09-13 13:26:03.455703"]]
---
  def create
    tournament = Tournament.create(tournament_params)

DELETE FROM "tournaments" WHERE "tournaments"."id" = ?  [["id", 1]]
---
  def destroy
    tournament = Tournament.destroy(params[:id])

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT 1  [["id", 28]]
---
  def add_player
    player = Player.find(params[:id])
    tourney = Tournament.find(params[:tourney_id])