day1/sandwichr-master/app/controllers/api/v1/sandwiches_controller.rb

SELECT "sandwiches".* FROM "sandwiches"
---
	def index
	  sandwiches = Sandwich.all

SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", 2]]
---
	def add

		sandwich = Sandwich.find_by(id: params[:sandwich_id])
		unless sandwich
			render json: {error: "we don't have that anymore"}, status: 404
			return
		end

		ingredient = Ingredient.find_by(id: params[:ingredient_id])